<a href="https://colab.research.google.com/github/Syedriyaz13/PPML_numpy/blob/main/Data_cleaning_and_preparation_excel.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
import pandas as pd
pd.set_option("display.max_columns",6)
print("original data :\n")
df=pd.read_excel("/content/employee details 107.xlsx")
print(df)

original data :

    Emp ID Name Prefix First Name  ...       Mother's Name  \
0   677509        Drs.       Lois  ...        Helen Walker
1   940761         Ms.     Brenda  ...       Judy Robinson
2   428945         Dr.        Joe  ...  Stephanie Robinson
3   408351        Drs.      Diane  ...      Michelle Evans
4   193819         Mr.   Benjamin  ...   Elizabeth Russell
5   499687         Mr.    Patrick  ...        Laura Bailey
6   539712         Ms.      Nancy  ...          Judy Baker
7   380086        Mrs.      Carol  ...    Katherine Murphy
8   477616        Hon.    Frances  ...       Lillian Young
9   162402        Hon.      Diana  ...  Christina Peterson
10  231469         Mr.      Ralph  ...     Michelle Flores
11  153989       Prof.       Jack  ...    Sharon Alexander
12  386158        Mrs.    Melissa  ...          Maria King
13  301576        Hon.      Wayne  ...     Margaret Watson
14  441771        Mrs.     Cheryl  ...          Lois Scott
15  528509        Hon.      Paula  ...        Kathryn Diaz
16  912990         Mr.     Joshua  ...      Martha Stewart
17  214352         Ms.    Theresa  ...         Rebecca Lee
18  890290        Hon.      Julia  ...           Amy Scott

   Mother's Maiden Name    Salary
0                 Lewis  130121.0
1                 Perry   51063.0
2                Taylor   50155.0
3                 Allen  130121.0
4                Nelson       NaN
5             Henderson   72305.0
6                Thomas   98189.0
7              Peterson   60918.0
8                  Diaz  130121.0
9                  Ross   43010.0
10                Moore       NaN
11               Walker   82965.0
12                White  166892.0
13                Hayes   92758.0
14               Watson       NaN
15               Powell  152654.0
16                Jones  184896.0
17               Turner  197537.0
18                 King  141518.0

[19 rows x 10 columns]

In [ ]:
f=df['First Name'].str.strip()
f.to_excel("/content/employee details 107.xlsx")
print("\n Replace value")
k=df.fillna(method='pad')
print(k)
print("\n updated list\n")
k.to_excel("/content/employee details 107.xlsx")

 Replace value
    Emp ID Name Prefix First Name  ...       Mother's Name  \
0   677509        Drs.       Lois  ...        Helen Walker
1   940761         Ms.     Brenda  ...       Judy Robinson
2   428945         Dr.        Joe  ...  Stephanie Robinson
3   408351        Drs.      Diane  ...      Michelle Evans
4   193819         Mr.   Benjamin  ...   Elizabeth Russell
5   499687         Mr.    Patrick  ...        Laura Bailey
6   539712         Ms.      Nancy  ...          Judy Baker
7   380086        Mrs.      Carol  ...    Katherine Murphy
8   477616        Hon.    Frances  ...       Lillian Young
9   162402        Hon.      Diana  ...  Christina Peterson
10  231469         Mr.      Ralph  ...     Michelle Flores
11  153989       Prof.       Jack  ...    Sharon Alexander
12  386158        Mrs.    Melissa  ...          Maria King
13  301576        Hon.      Wayne  ...     Margaret Watson
14  441771        Mrs.     Cheryl  ...          Lois Scott
15  528509        Hon.      Paula  ...        Kathryn Diaz
16  912990         Mr.     Joshua  ...      Martha Stewart
17  214352         Ms.    Theresa  ...         Rebecca Lee
18  890290        Hon.      Julia  ...           Amy Scott

   Mother's Maiden Name    Salary
0                 Lewis  130121.0
1                 Perry   51063.0
2                Taylor   50155.0
3                 Allen  130121.0
4                Nelson  130121.0
5             Henderson   72305.0
6                Thomas   98189.0
7              Peterson   60918.0
8                  Diaz  130121.0
9                  Ross   43010.0
10                Moore   43010.0
11               Walker   82965.0
12                White  166892.0
13                Hayes   92758.0
14               Watson   92758.0
15               Powell  152654.0
16                Jones  184896.0
17               Turner  197537.0
18                 King  141518.0

[19 rows x 10 columns]

 updated list

<ipython-input-8-55eea5d11be9>:4: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  k=df.fillna(method='pad')

In [ ]:
print("\n Drop one particular column and its values:\n")
k.drop(['Last Name'],axis=1,inplace=True)
print(k)
print("\n updated list\n")
k.to_excel("/content/employee details 107.xlsx")

 Drop one particular column and its values:

   Name Prefix First Name                        E Mail  ...  \
0         Drs.       Lois       lois.walker@hotmail.com  ...
1          Ms.     Brenda     brenda.robinson@gmail.com  ...
2          Dr.        Joe        joe.robinson@gmail.com  ...
3         Drs.      Diane         diane.evans@yahoo.com  ...
4          Mr.   Benjamin  benjamin.russell@charter.net  ...
5          Mr.    Patrick        patrick.bailey@aol.com  ...
6          Ms.      Nancy            nancy.baker@bp.com  ...
7         Mrs.      Carol        carol.murphy@gmail.com  ...
8         Hon.    Frances       frances.young@gmail.com  ...
9         Hon.      Diana  diana.peterson@hotmail.co.uk  ...
10         Mr.      Ralph        ralph.flores@yahoo.com  ...
11       Prof.       Jack      jack.alexander@gmail.com  ...
12        Mrs.    Melissa      melissa.king@comcast.net  ...
13        Hon.      Wayne        wayne.watson@gmail.com  ...
14        Mrs.     Cheryl        cheryl.scott@gmail.com  ...
15        Hon.      Paula          paula.diaz@gmail.com  ...
16         Mr.     Joshua       joshua.stewart@yahoo.ca  ...
17         Ms.    Theresa         theresa.lee@gmail.com  ...
18        Hon.      Julia         julia.scott@apple.com  ...

         Mother's Name Mother's Maiden Name    Salary
0         Helen Walker                Lewis  130121.0
1        Judy Robinson                Perry   51063.0
2   Stephanie Robinson               Taylor   50155.0
3       Michelle Evans                Allen  130121.0
4    Elizabeth Russell               Nelson  130121.0
5         Laura Bailey            Henderson   72305.0
6           Judy Baker               Thomas   98189.0
7     Katherine Murphy             Peterson   60918.0
8        Lillian Young                 Diaz  130121.0
9   Christina Peterson                 Ross   43010.0
10     Michelle Flores                Moore   43010.0
11    Sharon Alexander               Walker   82965.0
12          Maria King                White  166892.0
13     Margaret Watson                Hayes   92758.0
14          Lois Scott               Watson   92758.0
15        Kathryn Diaz               Powell  152654.0
16      Martha Stewart                Jones  184896.0
17         Rebecca Lee               Turner  197537.0
18           Amy Scott                 King  141518.0

[19 rows x 7 columns]

 updated list